const products = {
	'VPN VLESS': `
Надежный VPN на базе протокола VLESS для обхода блокировок.

🌍 1 страна 🇳🇱 Нидерланды - 50₽ / в месяц

🌍 11 стран: - 100 ₽ / в месяц
1. 🇳🇱 Нидерланды.
2. 🇵🇱 Польша.
3. 🇬🇧 Великобритания.
4. 🇩🇪 Германия.
5. 🇰🇿 Казахстан.
6. 🇺🇸 США.
7. 🇮🇹 Италия.
8. 🇯🇵 Япония.
9. 🇫🇮 Финляндия.
10. 🇸🇪 Швеция.
11. 🇷🇺 Россия.`,
	'Perplexity Pro': `
Подписка на продвинутый ИИ поиск с доступом к таким передовым моделям как:
ChatGPT 5.2
Claude Sonnet 4.5
Gemini 3.0 Flash
Grok 4.1
Kimi K2 Thinking
ChatGPT 5.2 Thinking
Claude Sonnet 4.5 Thinking
Gemini 3.0 Pro
Gemini 3.0 Flash Thinking
Grok 4.1 Thinking

150 генераций изображений в день с такими моделями как:
Nano Banana
Seedream 4.0
GPT image 1
Flux.1

Персональные Пространства: Инструмент для создания тематических рабочих областей с предустановленными системными промптами и загруженными базами знаний.

Автоматизация: Возможность сохранения повторяющихся инструкций для запланированного запуска автоматически.

В подписку также входит: Comet Browser Первый ИИ-браузер, который не просто ищет, а действует: выполняет действия, заполняет формы позволяет управлять страницами браузера голосовыми командами.
`,
	'Spotify Premium Individual': `
Ваш личный аккаунт (новый)
• Без рекламы: непрерывное прослушивание треков.
• Оффлайн-режим: скачивание музыки для доступа без интернета.
• Максимальное качество: стриминг в 320 кбит/с.
• Безлимитные пропуски: возможность переключать любое количество песен.
`
};
const modal = document.getElementById('modal');
const modalImg = modal.querySelector('.modal-img');
const modalTitle = modal.querySelector('.modal-title');
const modalDesc = modal.querySelector('.modal-desc');
document.onclick = (e) => {
	const btn = e.target.closest('.product-card .buy-btn');
	if(btn){
		const card = btn.closest('.product-card');
		const title = card.querySelector('.product-title').textContent;
		modalImg.src = card.querySelector('.product-img').src;
		modalTitle.textContent = title;
		modalDesc.textContent = products[title] || 'Описание отсутствует';
		return modal.showModal();
	}
	if(e.target.classList.contains('contact')) location.href = 'https://t.me/psevdonimux_bot';
	if(e.target === modal) modal.close();
};